INSERT INTO provider (title) 
VALUES 
('Сады придонья'),
('Волжский посад')
;

INSERT INTO measure_unit (title) 
VALUES 
('Кг')
;

INSERT INTO currency_type (title) 
VALUES 
('RUB'),
('EUR'),
('USD')
;

INSERT INTO product_type (title) 
VALUES 
('Груша'),
('Яблоко')
;

INSERT INTO product (product_type, title) 
VALUES 
(1,'Вильямс'),
(1,'Чижовская'),
(2,'Гренни смит'),
(2,'Фуджи')
;

INSERT INTO delivery_status (title) 
VALUES 
('Ожидается'),
('В работе'),
('Полностью поставлено'),
('Частично поставлено'),
('Не поставлено'),
('Поставка отменена')
;

INSERT INTO address (title) 
VALUES 
('ул. Клары Цеткин, 2, Москва, Россия, 127299'),
('ул. Мира 30, Череповец, Вологодская обл., Россия, 162608')
;

INSERT INTO delivery (provider, address, delivery_datetime, status) 
VALUES 
(1,1,'2024-07-10 10:00:00',1),
(1,1,'2024-05-30 12:00:00',1),
(1,2,'2024-05-30 14:00:00',1),
(1,2,'2024-05-29 18:00:00',1),

(2,2,'2024-08-11 11:00:00',1),
(2,2,'2024-05-30 12:00:00',1),
(2,1,'2024-05-30 15:00:00',1),
(2,1,'2024-07-29 19:00:00',1),

(1,1,'2024-04-07 10:00:00',1),
(1,1,'2024-03-12 12:00:00',1),
(1,2,'2024-02-22 14:00:00',1),
(1,2,'2024-03-29 18:00:00',1),

(2,2,'2024-03-13 11:00:00',1),
(2,2,'2024-05-14 12:00:00',1),
(2,1,'2024-06-12 17:00:00',1),
(2,1,'2024-07-22 20:00:00',1)
;

INSERT INTO purchase_object (delivery, product, product_count, measure_unit, price_per_unit, currency_type, is_received) 
VALUES 
(1,1,150.5,1,137.45,1,FALSE),
(1,2,100.3,1,154.99,1,FALSE),
(1,3,30.8,1,256.32,1,FALSE),
(1,4,40,1,210,1,FALSE),

(2,1,58.8,1,120.33,1,FALSE),
(2,2,70,1,100.00,1,FALSE),

(3,3,270,1,60,1,FALSE),

(4,4,139.5,1,62.17,1,FALSE),

(5,1,124.2,1,99.99,1,FALSE),
(5,2,129.5,1,110.25,1,FALSE),
(5,3,170.8,1,90.134,1,FALSE),
(5,4,10,1,170,1,FALSE),

(6,1,134.2,1,111.49,1,FALSE),
(6,3,176.1,1,123.99,1,FALSE),
(6,4,114.0,1,123.46,1,FALSE),

(7,1,187.5,1,156.32,1,FALSE),
(7,4,146.7,1,139.31,1,FALSE),

(8,2,172.4,1,142.27,1,FALSE),
(8,3,130.2,1,125.15,1,FALSE),

(9,1,150.5,1,137.45,1,FALSE),
(9,2,100.3,1,154.99,1,FALSE),
(9,3,30.8,1,256.32,1,FALSE),
(9,4,40,1,210,1,FALSE),

(10,1,58.8,1,120.33,1,FALSE),
(10,2,70,1,100.00,1,FALSE),

(11,3,270,1,60,1,FALSE),

(12,4,139.5,1,62.17,1,FALSE),

(13,1,124.2,1,99.99,1,FALSE),
(13,2,129.5,1,110.25,1,FALSE),
(13,3,170.8,1,90.134,1,FALSE),
(13,4,10,1,170,1,FALSE),

(14,1,134.2,1,111.49,1,FALSE),
(14,3,176.1,1,123.99,1,FALSE),
(14,4,114.0,1,123.46,1,FALSE),

(15,1,187.5,1,156.32,1,FALSE),
(15,4,146.7,1,139.31,1,FALSE),

(16,2,172.4,1,142.27,1,FALSE),
(16,3,130.2,1,125.15,1,FALSE)
;

INSERT INTO reason (title) 
VALUES 
('Не поставлено'),
('Неверная продукция'),
('Некачественная продукция')
;



